CSI API ETABS v1
cCaseStaticNonlinear.SetResultsSaved Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetResultsSaved(
	string Name,
	bool SaveMultipleSteps,
	int MinSavedStates = 10,
	int MaxSavedStates = 100,
	bool PositiveOnly = true
)
Function SetResultsSaved (
	Name As String,
	SaveMultipleSteps As Boolean,
	Optional MinSavedStates As Integer = 10,
	Optional MaxSavedStates As Integer = 100,
	Optional PositiveOnly As Boolean = true
) As Integer
Dim instance As cCaseStaticNonlinear
Dim Name As String
Dim SaveMultipleSteps As Boolean
Dim MinSavedStates As Integer
Dim MaxSavedStates As Integer
Dim PositiveOnly As Boolean
Dim returnValue As Integer
returnValue = instance.SetResultsSaved(Name,
	SaveMultipleSteps, MinSavedStates,
	MaxSavedStates, PositiveOnly)
int SetResultsSaved(
	String^ Name,
	bool SaveMultipleSteps,
	int MinSavedStates = 10,
	int MaxSavedStates = 100,
	bool PositiveOnly = true
)
abstract SetResultsSaved :
        Name : string *
        SaveMultipleSteps : bool *
        ?MinSavedStates : int *
        ?MaxSavedStates : int *
        ?PositiveOnly : bool
(* Defaults:
        let _MinSavedStates = defaultArg MinSavedStates 10
        let _MaxSavedStates = defaultArg MaxSavedStates 100
        let _PositiveOnly = defaultArg PositiveOnly true
*)
-> int
Parameters
Name
Type: System.String
SaveMultipleSteps
Type: System.Boolean
MinSavedStates (Optional)
Type: System.Int32
MaxSavedStates (Optional)
Type: System.Int32
PositiveOnly (Optional)
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cCaseStaticNonlinear Interface
ETABSv1 Namespace